SaitovSP/src/Documents/Ведомость/Ведомость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Ведомость</name>
  <registerRecords>InformationRegister.ИсторияНачисленияЗароботнойПлаты</registerRecords>
  <registerRecords>AccumulationRegister.ЗароботнаяПлата</registerRecords>
  <attributes>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </attributes>
  <attributes>
    <name>Директор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Зарплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Ресторан</name>
      <type>
        <types>CatalogRef.Рестораны</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаработнаяПлата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SaitovSP/src/InformationRegisters/ИсторияНачисленияЗароботнойПлаты/ИсторияНачисленияЗароботнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияНачисленияЗароботнойПлаты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Отвественный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SaitovSP/src/AccumulationRegisters/ЗароботнаяПлата/ЗароботнаяПлата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗароботнаяПлата</name>
  <resources>
    <name>Зарплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ресторан</name>
    <type>
      <types>CatalogRef.Рестораны</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

SaitovSP/src/Documents/Ведомость/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ИсторияНачисленияЗароботнойПлаты
	Движения.ИсторияНачисленияЗароботнойПлаты.Записывать = Истина;
	Движение = Движения.ИсторияНачисленияЗароботнойПлаты.Добавить();
	Движение.Период = Дата;
	Движение.Отвественный = Директор;

	// регистр ЗароботнаяПлата Расход
	Движения.ЗароботнаяПлата.Записывать = Истина;
	Для Каждого ТекСтрокаЗарплаты Из Зарплаты Цикл
		Движение = Движения.ЗароботнаяПлата.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Ресторан = Ресторан;
		Движение.Сотрудник = ТекСтрокаЗарплаты.Сотрудник;
		Движение.Должность = ТекСтрокаЗарплаты.Должность;
		Движение.Зарплата = ТекСтрокаЗарплаты.ЗаработнаяПлата;
	КонецЦикла;

КонецПроцедуры
